In [1]:
import pandas as pd

In [2]:
towd_array = [[0,1,2],[3,4,5]]

In [3]:
pd.DataFrame(towd_array)

   0  1  2
0  0  1  2
1  3  4  5

In [4]:
dic_arr = {'a':[1,2,3], 'b':[4,5,6]}

In [5]:
pd.DataFrame(dic_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
list_arr = {'a': ['Tokyo', 'Kanagawa', 'Chiba'], 'b': ['Saitama', 'Tochigi', 'Ibaraki']}

In [7]:
pd.DataFrame(list_arr)

          a        b
0     Tokyo  Saitama
1  Kanagawa  Tochigi
2     Chiba  Ibaraki

In [8]:
tuple_arr = {'a': (1,2,3), 'b': (4,5,6)}

In [9]:
pd.DataFrame(tuple_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [10]:
mix_arr = {'a':[1,2,3], 'b':['a', 'b', 'c'], 'c':(4,5,6)}

In [11]:
pd.DataFrame(mix_arr)

   a  b  c
0  1  a  4
1  2  b  5
2  3  c  6

In [12]:
state = pd.Series(["Tokyo", "Osaka", "Aichi", "Hiroshima", "Fukuoka"])

In [13]:
population = pd.Series([13515, 8839, 7483, 2844, 5102])

In [14]:
num_household = pd.Series([6691, 3918, 3060, 1209, 2197])

In [15]:
statistic = pd.DataFrame({
    "state" : state,
    "population" : population,
    "num_household" : num_household,
})

In [16]:
statistic

   num_household  population      state
0           6691       13515      Tokyo
1           3918        8839      Osaka
2           3060        7483      Aichi
3           1209        2844  Hiroshima
4           2197        5102    Fukuoka

In [17]:
statistic_dict = {
    "population" : {"Tokyo": 13515, "Osaka": 8839, "Aichi": 7485, "Hiroshima": 2844, "Fukuoka": 5102},
    "num_household" : {"Osaka": 3918, "Aichi": 3060, "Tokyo": 6691, "Hiroshima": 1209, "Fukuoka": 2197},
}

In [18]:
statistic_2 = pd.DataFrame(statistic_dict)

In [19]:
statistic_2

           num_household  population
Aichi               3060        7485
Fukuoka             2197        5102
Hiroshima           1209        2844
Osaka               3918        8839
Tokyo               6691       13515

In [20]:
pd.DataFrame([{"Tokyo": 6691, "Osaka": 3918, "Hiroshima": 1209, "Aichi": 3060, "Fukuoka": 2197},
              {"Tokyo": 13515, "Osaka": 8839, "Hiroshima": 2488, "Aichi": 7843, "Fukuoka": 5102}],
             index=["num_household", "population"])

               Aichi  Fukuoka  Hiroshima  Osaka  Tokyo
num_household   3060     2197       1209   3918   6691
population      7843     5102       2488   8839  13515

In [21]:
pd.DataFrame([
    pd.Series([6691, 3918, 1209, 3060, 2197], 
             index=["Tokyo", "Osaka", "Hiroshima", "Aichi", "Fukuoka"]),
    pd.Series([13515, 8839, 2844, 7843, 5102],
             index=["Tokyo", "Osaka", "Hiroshima", "Aichi", "Fukuoka"])
], index=["num_household", "population"])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7843     5102

In [22]:
pd.DataFrame([
    (6691, 3918, 1209, 3060, 2197),
    [13515, 8839, 2844, 7834, 5102]
], index=["num_household", "population"], columns=["Tokyo", "Osaka", "Hiroshima", "Aichi", "Fukuoka"])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7834     5102

In [23]:
statistic

   num_household  population      state
0           6691       13515      Tokyo
1           3918        8839      Osaka
2           3060        7483      Aichi
3           1209        2844  Hiroshima
4           2197        5102    Fukuoka

In [24]:
pd.DataFrame(statistic)

   num_household  population      state
0           6691       13515      Tokyo
1           3918        8839      Osaka
2           3060        7483      Aichi
3           1209        2844  Hiroshima
4           2197        5102    Fukuoka

# Masked array

In [25]:
import numpy as np
import numpy.ma as ma

In [26]:
x = np.arange(10).reshape(2, 5)

In [27]:
mask = np.random.choice([0,1],size=10).reshape(2,5)

In [28]:
mask

array([[0, 1, 0, 0, 0],
       [1, 1, 0, 1, 0]])

In [29]:
mx = ma.masked_array(x, mask=mask)

In [30]:
pd.DataFrame(mx)

     0   1    2    3    4
0  0.0 NaN  2.0  3.0  4.0
1  NaN NaN  7.0  NaN  9.0

In [31]:
mx

masked_array(
  data=[[0, --, 2, 3, 4],
        [--, --, 7, --, 9]],
  mask=[[False,  True, False, False, False],
        [ True,  True, False,  True, False]],
  fill_value=999999)

dtypeでデータ型の指定

In [32]:
df = pd.DataFrame({
    'a': [1, 1, 0],
    'b': [0, 1, 0]}, dtype=bool)

In [33]:
df

       a      b
0   True  False
1   True   True
2  False  False

In [34]:
df

       a      b
0   True  False
1   True   True
2  False  False

In [35]:
df = pd.DataFrame({
    'a': [1, 1, 0],
    'b': [0, 1, 0]}, dtype=float)

In [36]:
df

     a    b
0  1.0  0.0
1  1.0  1.0
2  0.0  0.0

引数copyの指定

In [37]:
df

     a    b
0  1.0  0.0
1  1.0  1.0
2  0.0  0.0

In [38]:
df_2 = pd.DataFrame(df, copy=False)

In [39]:
df_3 = pd.DataFrame(df, copy=True)

In [40]:
df["c"] = df["a"] == df["b"]

In [41]:
df

     a    b      c
0  1.0  0.0  False
1  1.0  1.0   True
2  0.0  0.0   True

In [42]:
df_2

     a    b      c
0  1.0  0.0  False
1  1.0  1.0   True
2  0.0  0.0   True

In [43]:
df_3

     a    b
0  1.0  0.0
1  1.0  1.0
2  0.0  0.0

欠損値の補完

In [44]:
num_per_house = pd.Series(
    {"Tokyo": 1.99, "Osaka": 2.22, "Aichi": 2.41, "Hiroshima": 2.29})

In [45]:
statistic_2

           num_household  population
Aichi               3060        7485
Fukuoka             2197        5102
Hiroshima           1209        2844
Osaka               3918        8839
Tokyo               6691       13515

In [46]:
statistic_2["num_per_house"] = num_per_house

In [47]:
statistic_2

           num_household  population  num_per_house
Aichi               3060        7485           2.41
Fukuoka             2197        5102            NaN
Hiroshima           1209        2844           2.29
Osaka               3918        8839           2.22
Tokyo               6691       13515           1.99

データの追加方法

In [48]:
series = pd.Series([0,0,0])

In [49]:
df = pd.DataFrame([[1,2,4],[3,8,9]], index=["a","b"], columns=["new", "old", "now"])

In [50]:
df

   new  old  now
a    1    2    4
b    3    8    9

In [51]:
df["predict"] = series

In [52]:
df

   new  old  now  predict
a    1    2    4      NaN
b    3    8    9      NaN

値の削除

In [53]:
del df["predict"]

In [54]:
df

   new  old  now
a    1    2    4
b    3    8    9